RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
/**
 *******************************************************************************
 * @file  hc32f4a0_i2c.c
 * @brief This file provides firmware functions to manage the Inter-Integrated
 *        Circuit(I2C).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hexiao          First version
   2020-07-15       Hexiao          Modify I2C_SmBusCmd to I2C_SetMode
   2020-08-31       Hexiao          Refine I2C_Init/I2C_SendData/I2C_RcvData
   2020-09-15       Hexiao          Modify I2C_RcvData for manually ack and nack
   2020-10-30       Hexiao          Optimize data transfer api,etc.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_i2c.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_I2C I2C
 * @brief I2C Driver Library
 * @{
 */

#if (DDL_I2C_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup I2C_Local_Macros I2C Local Macros
 * @{
 */

#define I2C_CLR_MASK                       (0x00F052DFUL)
#define I2C_INT_MASK                       (0x00F052DFUL)
#define I2C_SCL_HIGHT_LOW_LVL_SUM_MAX      ((float32_t)0x1F*(float32_t)2)


/**
 * @defgroup I2C_Check_Parameters_Validity I2C Check Parameters Validity
 * @{
 */
#define IS_VALID_UNIT(x)                                                       \
(   ((x) == M4_I2C1)                               ||                          \
    ((x) == M4_I2C2)                               ||                          \
    ((x) == M4_I2C3)                               ||                          \
    ((x) == M4_I2C4)                               ||                          \
    ((x) == M4_I2C5)                               ||                          \
    ((x) == M4_I2C6))

#define IS_VALID_MODE(x)                                                       \
(   ((x) == I2C_MODE_I2C)                          ||                          \
    ((x) == I2C_MODE_SMBUS))

#define IS_VALID_CLEARBIT(x)       ((0U != (x)) && (0U == ((x) & (~I2C_CLR_MASK))))

#define IS_VALID_INT(x)            ((0U != (x)) && (0U == ((x) & (~I2C_INT_MASK))))

#define IS_VALID_SPEED(speed)      ((0U != (speed)) && ((speed) <= (I2C_BAUDRATE_MAX)))

#define IS_VALID_DIGITAL_FILTER(x) ((x) <= I2C_DIG_FILTMODE_4CYCLE)

#define IS_VALID_RD_STATUS_BIT(x)                                              \
(   ((x) == I2C_SR_STARTF)                         ||                          \
    ((x) == I2C_SR_SLADDR0F)                       ||                          \
    ((x) == I2C_SR_SLADDR1F)                       ||                          \
    ((x) == I2C_SR_TENDF)                          ||                          \
    ((x) == I2C_SR_STOPF)                          ||                          \
    ((x) == I2C_SR_RFULLF)                         ||                          \
    ((x) == I2C_SR_TEMPTYF)                        ||                          \
    ((x) == I2C_SR_ARLOF)                          ||                          \
    ((x) == I2C_SR_ACKRF)                          ||                          \
    ((x) == I2C_SR_NACKF)                          ||                          \
    ((x) == I2C_SR_TMOUTF)                         ||                          \
    ((x) == I2C_SR_MSL)                            ||                          \
    ((x) == I2C_SR_BUSY)                           ||                          \
    ((x) == I2C_SR_TRA)                            ||                          \
    ((x) == I2C_SR_GENCALLF)                       ||                          \
    ((x) == I2C_SR_SMBDEFAULTF)                    ||                          \
    ((x) == I2C_SR_SMBHOSTF)                       ||                          \
    ((x) == I2C_SR_SMBALRTF))

#define IS_VALID_SMBUS_CONFIG(x)      ((0U != (x)) &&                          \
                                      (0U == ((x) & (~(uint32_t)I2C_SMBUS_CONFIG_CLEARMASK))))

#define IS_VALID_7BIT_ADDR(x)         ((x) <= 0x7FUL)
#define IS_VALID_10BIT_ADDR(x)        ((x) <= 0x3FFUL)


#define IS_VALID_ADDR_NUM(x)                                                   \
(   ((x) == I2C_ADDR_0)                            ||                          \
    ((x) == I2C_ADDR_1))

#define IS_VALID_CLK_DIV(x)                                                    \
(   ((x) == I2C_CLK_DIV1)                          ||                          \
    ((x) == I2C_CLK_DIV2)                          ||                          \
    ((x) == I2C_CLK_DIV4)                          ||                          \
    ((x) == I2C_CLK_DIV8)                          ||                          \
    ((x) == I2C_CLK_DIV16)                         ||                          \
    ((x) == I2C_CLK_DIV32)                         ||                          \
    ((x) == I2C_CLK_DIV64)                         ||                          \
    ((x) == I2C_CLK_DIV128))

#define IS_VALID_DIR(x)                                                        \
(   ((x) == I2C_DIR_TX)                            ||                          \
    ((x) == I2C_DIR_RX))

#define IS_VALID_ACK_CONFIG(x)                                                 \
(   ((x) == I2C_ACK)                               ||                          \
    ((x) == I2C_NACK))
/**
 * @}
 */

/**
 * @}
 */

