RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static en_result_t I2C_WaitStatus(const M4_I2C_TypeDef *I2Cx, uint32_t u32Flags, en_flag_status_t enStatus, uint32_t u32Timeout);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup I2C_Global_Functions I2C Global Functions
 * @{
 */

/**
 * @brief  Set the baudrate for I2C peripheral.
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] pstcI2C_InitStruct   Pointer to I2C configuration structure
 *                                   @ref stc_i2c_init_t
 *         @arg pstcI2C_InitStruct->u32ClkDiv: Division of Pclk3, reference as:
 *              step1: calculate div = (Pclk3/Baudrate/(68+2*dnfsum+SclTime)
 *                     Pclk3 -- system clock
 *                     Baudrate -- baudrate of i2c
 *                     SclTime -- =(SCL rising time + SCL falling time)/period of i2c clock
 *                                according to i2c bus hardware parameter.
 *                     dnfsum -- 0 if digital filter off;
 *                               Filter capacity if digital filter on(1 ~ 4)
 *              step2: chose a division item which is similar and bigger than div
 *                     from @ref I2C_Clock_division.
 *         @arg pstcI2C_InitStruct->u32Baudrate : Baudrate configuration
 *         @arg pstcI2C_InitStruct->u32SclTime : Indicate SCL pin rising and
 *              falling time, should be number of T(i2c clock period time)
 * @param  [out] pf32Err               Baudrate error
 * @retval en_result_t
 */
en_result_t I2C_BaudrateConfig(M4_I2C_TypeDef* I2Cx, const stc_i2c_init_t *pstcI2C_InitStruct, float32_t *pf32Err)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    en_result_t enRet = Ok;
    uint32_t u32Pclk3;
    uint32_t I2cDivClk;
    uint32_t SclCnt;
    uint32_t Baudrate;
    uint32_t dnfsum = 0UL;
    uint32_t divsum = 2UL;
    float32_t WidthTotal;
    float32_t SumTotal;
    float32_t WidthHL;
    float32_t fErr = 0.0F;

    if ((NULL == pstcI2C_InitStruct) || (NULL == pf32Err))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SPEED(pstcI2C_InitStruct->u32Baudrate));
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcI2C_InitStruct->u32ClkDiv));

        /* Get configuration for i2c */
        u32Pclk3 = SystemCoreClock >> ((M4_CMU->SCFGR & CMU_SCFGR_PCLK3S) >> CMU_SCFGR_PCLK3S_POS);
        I2cDivClk = 1UL << pstcI2C_InitStruct->u32ClkDiv;
        SclCnt = pstcI2C_InitStruct->u32SclTime;
        Baudrate = pstcI2C_InitStruct->u32Baudrate;

        /* Judge digital filter status*/
        if(0U != READ_REG32_BIT(I2Cx->FLTR, I2C_FLTR_DNFEN))
        {
            dnfsum = (READ_REG32_BIT(I2Cx->FLTR, I2C_FLTR_DNF) >> I2C_FLTR_DNF_POS) + 1U;
        }

        /* Judge if clock divider on*/
        if(I2C_CLK_DIV1 == I2cDivClk)
        {
            divsum = 3UL;
        }

        WidthTotal = (float32_t)u32Pclk3 / (float32_t)Baudrate / (float32_t)I2cDivClk;
        SumTotal = 2.0F*(float32_t)divsum + 2.0F*(float32_t)dnfsum + (float32_t)SclCnt;
        WidthHL = WidthTotal - SumTotal;

        if(WidthTotal <= SumTotal)
        {
            /* Err, Should set a smaller division value for pstcI2C_InitStruct->u32ClkDiv */
            enRet = ErrorInvalidParameter;
        }
        else if(WidthHL > I2C_SCL_HIGHT_LOW_LVL_SUM_MAX)
        {
            /* Err, Should set a bigger division value for pstcI2C_InitStruct->u32ClkDiv */
            enRet = ErrorInvalidParameter;
        }
        else
        {
            fErr =(WidthHL - (float32_t)((uint32_t)WidthHL)) / WidthHL;
            WRITE_REG32(I2Cx->CCR, (pstcI2C_InitStruct->u32ClkDiv << I2C_CCR_FREQ_POS)     \
                           | (((uint32_t)WidthHL/2U) << I2C_CCR_SLOWW_POS)              \
                           | (((uint32_t)WidthHL - (uint32_t)WidthHL/2U) << I2C_CCR_SHIGHW_POS));
        }
    }

    if((NULL != pf32Err)&&(Ok == enRet))
    {
        *pf32Err = fErr;
    }

    return enRet;
}

/**
 * @brief  De-initialize I2C unit
 * @param  [in] I2Cx   Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @retval None
 */
void I2C_DeInit(M4_I2C_TypeDef* I2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    /* Reset peripheral register and internal status*/
    CLEAR_REG32_BIT(I2Cx->CR1,I2C_CR1_PE);
    SET_REG32_BIT(I2Cx->CR1,I2C_CR1_SWRST);
}

/**
 * @brief  Initialize structure stc_i2c_init_t variable with default value.
 * @param  [out] pstcI2C_InitStruct     Pointer to a stc_i2c_init_t structure variable
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_i2c_init_t.
 * @retval en_result_t
 */
en_result_t I2C_StructInit(stc_i2c_init_t* pstcI2C_InitStruct)
{
    en_result_t enRet = Ok;

    if (pstcI2C_InitStruct == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcI2C_InitStruct->u32Baudrate = 50000UL;
        pstcI2C_InitStruct->u32ClkDiv = I2C_CLK_DIV1;
        pstcI2C_InitStruct->u32SclTime = 0UL;
    }

    return enRet;
}

/**
 * @brief  Initialize I2C peripheral according to the structure
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] pstcI2C_InitStruct   Pointer to I2C configuration structure
 *                                   @ref stc_i2c_init_t
 *         @arg pstcI2C_InitStruct->u32ClkDiv: Division of Pclk3, reference as:
 *              step1: calculate div = (Pclk3/Baudrate/(68+2*dnfsum+SclTime)
 *                     Pclk3 -- system clock
 *                     Baudrate -- baudrate of i2c
 *                     SclTime -- =(SCL rising time + SCL falling time)/period of i2c clock
 *                                according to i2c bus hardware parameter.
 *                     dnfsum -- 0 if digital filter off;
 *                               Filter capacity if digital filter on(1 ~ 4)
 *              step2: chose a division item which is similar and bigger than div
 *                     from @ref I2C_Clock_division.
 *         @arg pstcI2C_InitStruct->u32Baudrate : Baudrate configuration
 *         @arg pstcI2C_InitStruct->u32SclTime : Indicate SCL pin rising and
 *              falling time, should be number of T(i2c clock period time)
 * @param  [out] pf32Err               Baudrate error
 * @retval en_result_t
 */
en_result_t I2C_Init(M4_I2C_TypeDef* I2Cx, const stc_i2c_init_t *pstcI2C_InitStruct, float32_t *pf32Err)
{
    en_result_t enRet;
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

