RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
    if (NULL == pstcI2C_InitStruct )
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_VALID_SPEED(pstcI2C_InitStruct->u32Baudrate));
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcI2C_InitStruct->u32ClkDiv));

        /* Register and internal status reset */
        CLEAR_REG32_BIT(I2Cx->CR1,I2C_CR1_PE);
        SET_REG32_BIT(I2Cx->CR1,I2C_CR1_SWRST);
        SET_REG32_BIT(I2Cx->CR1,I2C_CR1_PE);

        /* I2C baudrate config */
        enRet = I2C_BaudrateConfig(I2Cx, pstcI2C_InitStruct, pf32Err);

        if(enRet == Ok)
        {
            /* Disable global broadcast address function */
            CLEAR_REG32_BIT(I2Cx->CR1,I2C_CR1_ENGC);

            /* Release software reset */
            CLEAR_REG32_BIT(I2Cx->CR1,I2C_CR1_SWRST);
            /* Disable I2C peripheral */
            CLEAR_REG32_BIT(I2Cx->CR1,I2C_CR1_PE);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable the specified I2C slave address function
 * @param  [in] I2Cx                Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32AddrNum           I2C address 0 or address 1 @ref I2C_Address_Num
 *                                   This parameter can be one of the following values:
 *                                   @arg I2C_ADDR_0
 *                                   @arg I2C_ADDR_1
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_SlaveAddrCmd(M4_I2C_TypeDef* I2Cx, uint32_t u32AddrNum, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_ADDR_NUM(u32AddrNum));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    __IO uint32_t* pu32SLRx = (__IO uint32_t*)((uint32_t)&I2Cx->SLR0 + u32AddrNum * 4UL);

    if(Enable == enNewState)
    {
        SET_REG32_BIT(*pu32SLRx, I2C_SLR0_SLADDR0EN);
    }
    else
    {
        CLEAR_REG32_BIT(*pu32SLRx, I2C_SLR0_SLADDR0EN);
    }
}

/**
 * @brief  I2C slave address config
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32AddrNum            I2C address 0 or address 1 @ref I2C_Address_Num
 *                                    This parameter can be one of the following values:
 *                                    @arg I2C_ADDR_0
 *                                    @arg I2C_ADDR_1
 * @param  [in] u32AddrMode           Address mode configuration,@ref  I2C_Addr_Config
 *                                    This parameter can be one of the following values:
 *                                    @arg I2C_ADDR_MODE_7BIT
 *                                    @arg I2C_ADDR_MODE_10BIT
 * @param  [in] u32Addr               The slave address
 * @retval None
 */
void I2C_SlaveAddrConfig(M4_I2C_TypeDef* I2Cx, uint32_t u32AddrNum, uint32_t u32AddrMode, uint32_t u32Addr)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_ADDR_NUM(u32AddrNum));


    __IO uint32_t* pu32SLRx = (__IO uint32_t*)((uint32_t)&I2Cx->SLR0 + u32AddrNum * 4UL);

    if(I2C_ADDR_MODE_10BIT == u32AddrMode)
    {
        DDL_ASSERT(IS_VALID_10BIT_ADDR(u32Addr));
        MODIFY_REG32(*pu32SLRx, I2C_SLR0_ADDRMOD0 | I2C_SLR0_SLADDR0, u32AddrMode + u32Addr);
    }
    else
    {
        DDL_ASSERT(IS_VALID_7BIT_ADDR(u32Addr));
        MODIFY_REG32(*pu32SLRx, I2C_SLR0_ADDRMOD0 | I2C_SLR0_SLADDR0, u32AddrMode + (u32Addr << 1));
    }
}

/**
 * @brief  Configure peripheral mode
 * @param  [in] I2Cx   Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32Mode This parameter can be one of the following values:
 *         @arg I2C_MODE_I2C
 *         @arg I2C_MODE_SMBUS
 * @retval None
 */
void I2C_SetMode(M4_I2C_TypeDef* I2Cx, uint32_t u32Mode)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_MODE(u32Mode));

    MODIFY_REG32(I2Cx->CR1, I2C_CR1_SMBUS, u32Mode);
}

/**
 * @brief  Enable or disable the specified I2C peripheral
 * @param  [in] I2Cx                Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_Cmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(I2Cx->CR1, I2C_CR1_PE, (uint32_t)enNewState << I2C_CR1_PE_POS);
}

/**
 * @brief Enable or disable the I2C fast ack function
 * @param  [in] I2Cx           Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] enNewState      New state of the fast ACK function, can be
 *                             Disable or Enable the function
 * @retval None
 */
void I2C_FastAckCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        CLEAR_REG32_BIT(I2Cx->CR3, I2C_CR3_FACKEN);
    }
    else
    {
        SET_REG32_BIT(I2Cx->CR3, I2C_CR3_FACKEN);
    }
}

/**
 * @brief Enable or disable the bus wait function
 * @param  [in] I2Cx           Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] enNewState      New state of the bus wait function, can be
 *                             Disable or Enable the function
 * @retval None
 */
void I2C_BusWaitCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    uint32_t u32CR4_Reg = ((uint32_t)&I2Cx->CR3) + 4UL;
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

