RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
    if(Enable == enNewState)
    {
        *(__IO uint32_t *)u32CR4_Reg |= (1UL << 10UL);
    }
    else
    {
        *(__IO uint32_t *)u32CR4_Reg &= ~(1UL << 10UL);
    }
}

/**
 * @brief  I2C SCL high level timeout configuration
 * @param  [in] I2Cx       Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] u16TimeoutH  clock timeout period for high level
 * @retval None
 */
void I2C_ClkHighTimeoutConfig(M4_I2C_TypeDef* I2Cx, uint16_t u16TimeoutH)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    CLEAR_REG32_BIT(I2Cx->SLTR, I2C_SLTR_TOUTHIGH);
    SET_REG32_BIT(I2Cx->SLTR, ((uint32_t)u16TimeoutH << 16U));
}

/**
 * @brief  I2C SCL low level timeout configuration
 * @param  [in] I2Cx       Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] u16TimeoutL  clock timeout period for low level
 * @retval None
 */
void I2C_ClkLowTimeoutConfig(M4_I2C_TypeDef* I2Cx, uint16_t u16TimeoutL)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    CLEAR_REG32_BIT(I2Cx->SLTR, I2C_SLTR_TOUTLOW);
    SET_REG32_BIT(I2Cx->SLTR, u16TimeoutL);
}

/**
 * @brief  Enable or disable I2C SCL high level timeout function
 * @param  [in] I2Cx       Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] enNewState  New state of the I2C SCL high level timeout function,
 *                         can be Disable or Enable the function
 * @retval None
 */
void I2C_ClkHighTimeoutCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(I2Cx->CR3, I2C_CR3_HTMOUT);
    }
    else
    {
        CLEAR_REG32_BIT(I2Cx->CR3, I2C_CR3_HTMOUT);
    }
}

/**
 * @brief  Enable or disable I2C SCL low level timeout function
 * @param  [in] I2Cx       Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] enNewState  New state of the I2C SCL low level timeout function
 *                         can be Disable or Enable the function
 * @retval None
 */
void I2C_ClkLowTimeoutCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(I2Cx->CR3, I2C_CR3_LTMOUT);
    }
    else
    {
        CLEAR_REG32_BIT(I2Cx->CR3, I2C_CR3_LTMOUT);
    }
}

/**
 * @brief  Enable or disable I2C SCL timeout function
 * @param  [in] I2Cx      Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param [in] enNewState New state of the I2C SCL timeout function, can be
 *                        Disable or Enable the function
 * @retval None
 */
void I2C_ClkTimeoutCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(I2Cx->CR3, I2C_CR3_TMOUTEN);
    }
    else
    {
        CLEAR_REG32_BIT(I2Cx->CR3, I2C_CR3_TMOUTEN);
    }
}

/**
 * @brief  Config I2C SMBUS address match function
 * @param  [in] I2Cx                    Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32SmbusConfig          Indicate the SMBUS address match function configuration.
 *         This parameter can be one or any combination of the following values:
 *         @ref I2C_Smbus_Match_Cfg
 *         @arg I2C_SMBUS_MATCH_ALRT    : Smbus alarm address
 *         @arg I2C_SMBUS_MATCH_DEFAULT : Smbus default address
 *         @arg I2C_SMBUS_MATCH_HOST    : Smbus host address address
 * @param  [in] enNewState              New state of the I2Cx SMBUS match config,
 *                                      @ref en_functional_state_t
 * @retval None
 */
void I2C_SmbusConfig(M4_I2C_TypeDef* I2Cx, uint32_t u32SmbusConfig, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_SMBUS_CONFIG(u32SmbusConfig));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(I2Cx->CR1, u32SmbusConfig);
    }
    else
    {
        CLEAR_REG32_BIT(I2Cx->CR1, u32SmbusConfig);
    }
}

/**
 * @brief  Config I2C digital filter mode
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32DigFilterMode     Chose the digital filter mode,
 *         @ref I2C_Digital_Filter_mode
 *         This parameter can be one of the following values:
 *         @arg I2C_DIG_FILTMODE_1CYCLE
 *         @arg I2C_DIG_FILTMODE_2CYCLE
 *         @arg I2C_DIG_FILTMODE_3CYCLE
 *         @arg I2C_DIG_FILTMODE_4CYCLE
 * @retval None
 */
void I2C_DigitalFilterConfig(M4_I2C_TypeDef* I2Cx, uint32_t u32DigFilterMode)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_DIGITAL_FILTER(u32DigFilterMode));

    MODIFY_REG32(I2Cx->FLTR, I2C_FLTR_DNF, u32DigFilterMode);
}

/**
 * @brief  Enable or disable I2C digital filter function
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_DigitalFilterCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(I2Cx->FLTR, I2C_FLTR_DNFEN, (uint32_t)enNewState << I2C_FLTR_DNFEN_POS);
}

/**
 * @brief  Enable or disable I2C analog filter function
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_AnalogFilterCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(I2Cx->FLTR, I2C_FLTR_ANFEN, (uint32_t)enNewState << I2C_FLTR_ANFEN_POS);
}

/**
 * @brief  Enable or disable I2C general call function
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_GeneralCallCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(I2Cx->CR1, I2C_CR1_ENGC, (uint32_t)enNewState << I2C_CR1_ENGC_POS);
}

/**
 * @brief  Generate I2Cx communication start condition
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @retval None
 */
void I2C_GenerateStart(M4_I2C_TypeDef* I2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

