RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
    SET_REG32_BIT(I2Cx->CR1, I2C_CR1_START);
}

/**
 * @brief  Generate I2Cx communication restart condition
 * @param  [in] I2Cx                  Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @retval None
 */
void I2C_GenerateReStart(M4_I2C_TypeDef* I2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    SET_REG32_BIT(I2Cx->CR1, I2C_CR1_RESTART);
}

/**
 * @brief  Generate I2Cx communication stop condition
 * @param  [in] I2Cx                  Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @retval None
 */
void I2C_GenerateStop(M4_I2C_TypeDef* I2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    SET_REG32_BIT(I2Cx->CR1, I2C_CR1_STOP);
}

/**
 * @brief  Check whether the specified I2C flag is set or not
 * @param  [in] I2Cx                  Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32StatusBit         specify the flag to check,
 *         This parameter can be one of the following values:
 *         @arg   I2C_SR_STARTF     : Start condition detected flag
 *         @arg   I2C_SR_SLADDR0F   : Address 0 detected flag
 *         @arg   I2C_SR_SLADDR1F   : Address 1 detected flag
 *         @arg   I2C_SR_TENDF      : Transfer end flag
 *         @arg   I2C_SR_STOPF      : Stop condition detected flag
 *         @arg   I2C_SR_RFULLF     : Receive buffer full flag
 *         @arg   I2C_SR_TEMPTYF    : Transfer buffer empty flag
 *         @arg   I2C_SR_ARLOF      : Arbitration fails flag
 *         @arg   I2C_SR_ACKRF      : ACK detected flag
 *         @arg   I2C_SR_NACKF      : NACK detected flag
 *         @arg   I2C_SR_TMOUTF     : Time out detected flag
 *         @arg   I2C_SR_MSL        : Master mode flag
 *         @arg   I2C_SR_BUSY       : Bus busy status flag
 *         @arg   I2C_SR_TRA        : Transfer mode flag
 *         @arg   I2C_SR_GENCALLF   : General call detected flag
 *         @arg   I2C_SR_SMBDEFAULTF: Smbus default address detected flag
 *         @arg   I2C_SR_SMBHOSTF   : Smbus host address detected flag
 *         @arg   I2C_SR_SMBALRTF   : Smbus alarm address detected flag
 * @retval The status of the I2C status flag, may be Set or Reset.
 */
en_flag_status_t I2C_GetStatus(const M4_I2C_TypeDef *I2Cx, uint32_t u32StatusBit)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_RD_STATUS_BIT(u32StatusBit));

    return ((0UL != READ_REG32_BIT(I2Cx->SR, u32StatusBit)) ? Set : Reset);
}

/**
 * @brief  Clear I2C status flag
 * @param  [in] I2Cx                  Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32StatusBit          Specify the flag to clear,
 *         This parameter can be any combination of the following values:
 *         @arg  I2C_CLR_STARTFCLR     : Start flag clear
 *         @arg  I2C_CLR_SLADDR0FCLR   : Address 0 detected flag clear
 *         @arg  I2C_CLR_SLADDR1FCLR   : Address 1 detected flag clear
 *         @arg  I2C_CLR_TENDFCLR      : Transfer end flag clear
 *         @arg  I2C_CLR_STOPFCLR      : Stop flag clear
 *         @arg  I2C_CLR_RFULLFCLR     : Receive buffer full flag clear
 *         @arg  I2C_CLR_TEMPTYFCLR    : Transfer buffer empty flag clear
 *         @arg  I2C_CLR_ARLOFCLR      : Arbitration fails flag clear
 *         @arg  I2C_CLR_NACKFCLR      : NACK detected flag clear
 *         @arg  I2C_CLR_TMOUTFCLR     : Time out detected flag clear
 *         @arg  I2C_CLR_GENCALLFCLR   : General call address detected flag clear
 *         @arg  I2C_CLR_SMBDEFAULTFCLR: Smbus default address detected flag clear
 *         @arg  I2C_CLR_SMBHOSTFCLR   : Smbus host address detected flag clear
 *         @arg  I2C_CLR_SMBALRTFCLR   : Smbus alarm address detected flag clear
 * @retval None
 */
void I2C_ClearStatus(M4_I2C_TypeDef* I2Cx, uint32_t u32StatusBit)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_CLEARBIT(u32StatusBit));

    WRITE_REG32(I2Cx->CLR,u32StatusBit);
}

/**
 * @brief  I2C software reset function command
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_SoftwareResetCmd(M4_I2C_TypeDef* I2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(I2Cx->CR1, I2C_CR1_SWRST, (uint32_t)enNewState << I2C_CR1_SWRST_POS);
}

/**
 * @brief  Enable or disable the specified I2C interrupts
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32IntEn   Specify the I2C interrupts sources to be configuration.
 *         This parameter can be any combination of the following values:
 *         @arg    I2C_CR2_STARTIE      : Start flag interrupt
 *         @arg    I2C_CR2_SLADDR0IE    : Address 0 detected interrupt
 *         @arg    I2C_CR2_SLADDR1IE    : Address 1 detected interrupt
 *         @arg    I2C_CR2_TENDIE       : Transfer end interrupt
 *         @arg    I2C_CR2_STOPIE       : Stop flag interrupt
 *         @arg    I2C_CR2_RFULLIE      : Receive buffer full interrupt
 *         @arg    I2C_CR2_TEMPTYIE     : Transfer buffer empty interrupt
 *         @arg    I2C_CR2_ARLOIE       : Arbitration fails interrupt
 *         @arg    I2C_CR2_NACKIE       : NACK flag detected interrupt
 *         @arg    I2C_CR2_TMOUTIE      : Time out detected interrupt
 *         @arg    I2C_CR2_GENCALLIE    : General call address detected interrupt
 *         @arg    I2C_CR2_SMBDEFAULTIE : Smbus default address detected interrupt
 *         @arg    I2C_CR2_SMBHOSTIE    : Smbus host address detected interrupt
 *         @arg    I2C_CR2_SMBALRTIE    : Smbus alarm address detected interrupt
 * @param  [in] enNewState           New state of the I2Cx interrupt function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_IntCmd(M4_I2C_TypeDef* I2Cx, uint32_t u32IntEn, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_INT(u32IntEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

