RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
    if(Enable == enNewState)
    {
        SET_REG32_BIT(I2Cx->CR2, u32IntEn);
    }
    else
    {
        CLEAR_REG32_BIT(I2Cx->CR2, u32IntEn);
    }
}

/**
 * @brief  Send data byte
 * @param  [in] I2Cx                 Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u8Data               The data to be send
 * @retval None
 */
void I2C_WriteDataReg(M4_I2C_TypeDef* I2Cx, uint8_t u8Data)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    WRITE_REG8(I2Cx->DTR, u8Data);
}

/**
 * @brief  Read the most recent received data byte
 * @param  [in] I2Cx   Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @retval The value of the received data
 */
uint8_t I2C_ReadDataReg(const M4_I2C_TypeDef *I2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    return READ_REG8(I2Cx->DRR);
}

/**
 * @brief  Config I2C ACK status
 * @param  [in] I2Cx                Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32AckConfig        Ack configuration
 *         This parameter can be one of the following values:
 *         @arg I2C_ACK
 *         @arg I2C_NACK
 * @retval None
 */
void I2C_AckConfig(M4_I2C_TypeDef* I2Cx, uint32_t u32AckConfig)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_ACK_CONFIG(u32AckConfig));

    MODIFY_REG32(I2Cx->CR1, I2C_CR1_ACK, u32AckConfig);
}

/**
 * @brief  I2Cx Start
 * @param  [in] I2Cx   Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in]  u32Timeout  Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Start successfully
 *            - Error: Start unsuccessfully
 */
en_result_t I2C_Start(M4_I2C_TypeDef* I2Cx, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    en_result_t enRet;

    enRet = I2C_WaitStatus(I2Cx, I2C_SR_BUSY, Reset, u32Timeout);

    if(Ok == enRet)
    {
        /* generate start signal */
        I2C_GenerateStart(I2Cx);
        /* Judge if start success*/
        enRet = I2C_WaitStatus(I2Cx, (I2C_SR_BUSY | I2C_SR_STARTF), Set, u32Timeout);
    }

    return enRet;
}

/**
 * @brief  I2Cx Restart
 * @param  [in] I2Cx         Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32Timeout  Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Restart successfully
 *            - Error: Restart unsuccessfully
 */
en_result_t I2C_Restart(M4_I2C_TypeDef* I2Cx, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    en_result_t enRet;

    /* Clear start status flag */
    I2C_ClearStatus(I2Cx, I2C_CLR_STARTFCLR);
    /* Send restart condition */
    I2C_GenerateReStart(I2Cx);
    /* Judge if start success*/
    enRet = I2C_WaitStatus(I2Cx, (I2C_SR_BUSY | I2C_SR_STARTF), Set, u32Timeout);

    return enRet;
}

/**
 * @brief  Send 7bit address
 * @param  [in] I2Cx         Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u8Addr       The address to be sent
 * @param  [in] u8Dir        Transfer direction,
 *                           This parameter can be one of the following values:
 *                           @arg I2C_DIR_TX
 *                           @arg I2C_DIR_RX
 * @param  [in] u32Timeout   Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Send successfully
 *            - Error: Send unsuccessfully or NACK received
 */
en_result_t I2C_TransAddr(M4_I2C_TypeDef* I2Cx, uint8_t u8Addr, uint8_t u8Dir, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_7BIT_ADDR(u8Addr));
    DDL_ASSERT(IS_VALID_DIR(u8Dir));

    en_result_t enRet;

    enRet = I2C_WaitStatus(I2Cx, I2C_SR_TEMPTYF, Set, u32Timeout);

    if(Ok == enRet)
    {
        /* Send I2C address */
        I2C_WriteDataReg(I2Cx, (uint8_t)(u8Addr << 1U) | u8Dir);

        if(I2C_DIR_TX == u8Dir)
        {
            /* If in master transfer process, wait transfer end */
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_TENDF, Set, u32Timeout);
        }
        else
        {
            /* If in master recevie process, wait I2C_SR_TRA changed to recevie */
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_TRA, Reset, u32Timeout);
        }

         /* If receive NACK*/
        if(enRet == Ok)
        {
            if(I2C_GetStatus(I2Cx, I2C_SR_ACKRF) == Set)
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}


/**
* @brief  Send 10bit Address
* @param  [in] I2Cx          Pointer to the I2C peripheral register
*         This parameter can be one of the following values:
*         @arg M4_I2C1
*         @arg M4_I2C2
*         @arg M4_I2C3
*         @arg M4_I2C4
*         @arg M4_I2C5
*         @arg M4_I2C6
* @param  [in] u16Addr       The address to be sent
* @param  [in] u8Dir         Transfer direction,
*         This parameter can be one of the following values:
*         @arg  I2C_DIR_TX
*         @arg  I2C_DIR_RX
* @param  [in]  u32Timeout   Maximum count of trying to get a status of a
*              flag in status register
* @retval An en_result_t enumeration value:
*            - Ok: Send successfully
*            - Error: Send unsuccessfully or NACK received
*/
en_result_t I2C_Trans10BitAddr(M4_I2C_TypeDef* I2Cx, uint16_t u16Addr, uint8_t u8Dir, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));
    DDL_ASSERT(IS_VALID_10BIT_ADDR(u16Addr));
    DDL_ASSERT(IS_VALID_DIR(u8Dir));

    en_result_t enRet;
    enRet = I2C_WaitStatus(I2Cx, I2C_SR_TEMPTYF, Set, u32Timeout);
    if(Ok == enRet)
    {
        /* Write 11110 + SLA(bit9:8) + W#(1bit) */
        I2C_WriteDataReg(I2Cx, (uint8_t)((u16Addr>>7U) & 0x06U) | 0xF0U | I2C_DIR_TX);
        enRet = I2C_WaitStatus(I2Cx, I2C_SR_TENDF, Set, u32Timeout);

        if(Ok == enRet)
        {
            /* If receive ACK */
            if(I2C_GetStatus(I2Cx, I2C_SR_ACKRF) == Reset)
            {
                /* Write SLA(bit7:0)*/
                I2C_WriteDataReg(I2Cx, (uint8_t)(u16Addr & 0xFFU));
                enRet = I2C_WaitStatus(I2Cx, I2C_SR_TENDF, Set, u32Timeout);

                if(Ok == enRet)
                {
                    if(I2C_GetStatus(I2Cx, I2C_SR_ACKRF) != Reset)
                    {
                        enRet = Error;
                    }
                }
            }
            else
            {
                enRet = Error;
            }
        }
    }

    if((u8Dir == I2C_DIR_RX) && (Ok == enRet))
    {
        /* Restart */
        I2C_ClearStatus(I2Cx, I2C_CLR_STARTFCLR);
        I2C_GenerateReStart(I2Cx);
        enRet = I2C_WaitStatus(I2Cx, I2C_SR_STARTF, Set, u32Timeout);

        if(Ok == enRet)
        {
            /* Write 11110 + SLA(bit9:8) + R(1bit) */
            I2C_WriteDataReg(I2Cx, (uint8_t)((u16Addr>>7U) & 0x06U) | 0xF0U | I2C_DIR_RX);
            /* If in master receive process, Need wait TRA flag */
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_TRA, Reset, u32Timeout);

            if(Ok == enRet)
            {
                /* If receive NACK */
                if(I2C_GetStatus(I2Cx, I2C_SR_ACKRF) != Reset)
                {
                    enRet = Error;
                }
            }
        }
    }

    return enRet;
}

/**
 * @brief  Send data bytes
 * @param  [in] I2Cx           Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] pau8TxData     The data array to be sent
 * @param  [in] u32Size        Number of data in array pau8TxData
 * @param  [in] u32Timeout     Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Send successfully
 *            - Error: Send unsuccessfully or NACK received
 *            - ErrorInvalidParameter: pau8TxData is NULL
 */
en_result_t I2C_TransData(M4_I2C_TypeDef* I2Cx, uint8_t const pau8TxData[], uint32_t u32Size, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    en_result_t enRet = Ok;
    uint32_t u32Cnt = 0UL;

    if(pau8TxData != NULL)
    {
        while((u32Cnt != u32Size) &&(enRet == Ok))
        {
            /* Wait tx buffer empty */
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_TEMPTYF, Set, u32Timeout);

            if(enRet == Ok)
            {
                /* Send one byte data */
                I2C_WriteDataReg(I2Cx, pau8TxData[u32Cnt]);
                /* Wait transfer end */
                enRet = I2C_WaitStatus(I2Cx, I2C_SR_TENDF, Set, u32Timeout);

