RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2c.c
                /* If receive NACK*/
                if(I2C_GetStatus(I2Cx, I2C_SR_ACKRF) == Set)
                {
                    break;
                }
                u32Cnt++;
            }
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  I2Cx Receive Data
 * @param  [in] I2Cx          Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [out] pau8RxData    Array to hold the received data
 * @param  [in]  u32Size       Number of data to be received
 * @param  [in]  u32Timeout    Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Receive successfully
 *            - Error: Receive unsuccessfully
 *            - ErrorInvalidParameter: pau8RxData is NULL
 */
en_result_t I2C_Receive(M4_I2C_TypeDef* I2Cx, uint8_t pau8RxData[], uint32_t u32Size, uint32_t u32Timeout)
{
    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    en_result_t enRet = Ok;

    if(pau8RxData != NULL)
    {
        uint32_t u32FastAckEn = READ_REG32_BIT(I2Cx->CR3, I2C_CR3_FACKEN);
        for(uint32_t i=0UL; i<u32Size; i++)
        {
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_RFULLF, Set, u32Timeout);

            if(0UL == u32FastAckEn)
            {
                if((u32Size >= 2UL) && (i == (u32Size - 2UL)))
                {
                    I2C_AckConfig(I2Cx, I2C_NACK);
                }
            }
            else
            {
                if(i != (u32Size - 1UL))
                {
                    I2C_AckConfig(I2Cx, I2C_ACK);
                }
                else
                {
                    I2C_AckConfig(I2Cx, I2C_NACK);
                }
            }

            if(enRet == Ok)
            {
                 /* read data from register */
                pau8RxData[i] = I2C_ReadDataReg(I2Cx);
            }
            else
            {
                break;
            }
        }
        I2C_AckConfig(I2Cx, I2C_ACK);
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Master receive data and stop
 * @param  [in] I2Cx           Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] au8RxData      Array to hold the received data
 * @param  [in] u32Size        Number of data to be received
 * @param  [in] u32Timeout     Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Receive successfully
 *            - Error: Receive or Stop unsuccessfully
 *            - ErrorInvalidParameter: au8RxData is NULL
 */
en_result_t I2C_MasterReceiveAndStop(M4_I2C_TypeDef* I2Cx, uint8_t au8RxData[], uint32_t u32Size, uint32_t u32Timeout)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    if(au8RxData != NULL)
    {
        uint32_t u32FastAckEn = READ_REG32_BIT(I2Cx->CR3, I2C_CR3_FACKEN);
        for(uint32_t i=0UL; i<u32Size; i++)
        {
            enRet = I2C_WaitStatus(I2Cx, I2C_SR_RFULLF, Set, u32Timeout);

            if(0UL == u32FastAckEn)
            {
                if((u32Size >= 2UL) && (i == (u32Size - 2UL)))
                {
                    I2C_AckConfig(I2Cx, I2C_NACK);
                }
            }
            else
            {
                if(i != (u32Size - 1UL))
                {
                    I2C_AckConfig(I2Cx, I2C_ACK);
                }
                else
                {
                    I2C_AckConfig(I2Cx, I2C_NACK);
                }
            }

            if(enRet == Ok)
            {
                /* Stop before read last data */
                if(i == (u32Size - 1UL))
                {
                    I2C_ClearStatus(I2Cx, I2C_SR_STOPF);
                    I2C_GenerateStop(I2Cx);
                }

                 /* read data from register */
                au8RxData[i] = I2C_ReadDataReg(I2Cx);

                if(i == (u32Size - 1UL))
                {
                    /* Wait stop flag after DRR read */
                    enRet = I2C_WaitStatus(I2Cx, I2C_SR_STOPF, Set, u32Timeout);
                }
            }
            else
            {
                break;
            }
        }
        I2C_AckConfig(I2Cx, I2C_ACK);
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}


/**
 * @brief  I2Cx Stop
 * @param  [in] I2Cx          Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in]  u32Timeout   Maximum count of trying to get a status of a
 *              flag in status register
 * @retval An en_result_t enumeration value:
 *            - Ok: Stop successfully
 *            - Error: Stop unsuccessfully
 */
en_result_t I2C_Stop(M4_I2C_TypeDef* I2Cx, uint32_t u32Timeout)
{
    en_result_t enRet;

    DDL_ASSERT(IS_VALID_UNIT(I2Cx));

    /* Clear stop flag */
    while((Set == I2C_GetStatus(I2Cx, I2C_SR_STOPF)) && (u32Timeout > 0UL))
    {
        I2C_ClearStatus(I2Cx, I2C_CLR_STOPFCLR);
        u32Timeout--;
    }
    I2C_GenerateStop(I2Cx);
    /* Wait stop flag */
    enRet = I2C_WaitStatus(I2Cx, I2C_SR_STOPF, Set, u32Timeout);

    return enRet;
}
/**
 * @}
 */

/**
* @defgroup I2C_Local_Functions I2C Local Functions
* @{
*/

/**
 * @brief  Try to wait a status of specified flags
 * @param  [in] I2Cx                Pointer to the I2C peripheral register.
 *         This parameter can be one of the following values:
 *         @arg M4_I2C1
 *         @arg M4_I2C2
 *         @arg M4_I2C3
 *         @arg M4_I2C4
 *         @arg M4_I2C5
 *         @arg M4_I2C6
 * @param  [in] u32Flags             specify the flags to check
 * @param  [in] enStatus             expected status,
 *         This parameter can be any combination of the following values:
 *         @arg   I2C_SR_STARTF     : Start condition detected flag
 *         @arg   I2C_SR_SLADDR0F   : Address 0 detected flag
 *         @arg   I2C_SR_SLADDR1F   : Address 1 detected flag
 *         @arg   I2C_SR_TENDF      : Transfer end flag
 *         @arg   I2C_SR_STOPF      : Stop condition detected flag
 *         @arg   I2C_SR_RFULLF     : Receive buffer full flag
 *         @arg   I2C_SR_TEMPTYF    : Transfer buffer empty flag
 *         @arg   I2C_SR_ARLOF      : Arbitration fails flag
 *         @arg   I2C_SR_ACKRF      : ACK detected flag
 *         @arg   I2C_SR_NACKF      : NACK detected flag
 *         @arg   I2C_SR_TMOUTF     : Time out detected flag
 *         @arg   I2C_SR_MSL        : Master mode flag
 *         @arg   I2C_SR_BUSY       : Bus busy status flag
 *         @arg   I2C_SR_TRA        : Transfer mode flag
 *         @arg   I2C_SR_GENCALLF   : General call detected flag
 *         @arg   I2C_SR_SMBDEFAULTF: Smbus default address detected flag
 *         @arg   I2C_SR_SMBHOSTF   : Smbus host address detected flag
 *         @arg   I2C_SR_SMBALRTF   : Smbus alarm address detected flag
 * @param  [in]  u32Timeout  Maximum count of trying to get a status of a
 *              flag in status register
 * @retval  Process result
 *          - Error         Failed to get expected status of specified flags
 *          - Ok            successfully gotten the expected status of the specified flags
 */
static en_result_t I2C_WaitStatus(const M4_I2C_TypeDef *I2Cx, uint32_t u32Flags, en_flag_status_t enStatus, uint32_t u32Timeout)
{
    en_result_t enRet = Error;
    uint32_t u32RegStatusBit;

    for(;;)
    {
        u32RegStatusBit = (READ_REG32_BIT(I2Cx->SR, u32Flags));
        if(((enStatus == Set) && (u32Flags == u32RegStatusBit))
           || ((enStatus == Reset) && (0UL == u32RegStatusBit)))
        {
            enRet = Ok;
        }

        if((Ok == enRet) || (0UL == u32Timeout))
        {
            break;
        }
        else
        {
            u32Timeout--;
        }
    }

    return enRet;
}

/**
* @}
*/

#endif /* DDL_I2C_ENABLE */

/**
* @}
*/

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
